#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("ПерепроведениеДокументов")
Процедура ГП_ПерепроведениеДокументов(СтруктураПараметров, АдресХранилища)

	ВремяНачала = ОценкаПроизводительности.НачатьЗамерВремени();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ?(НЕ СтруктураПараметров.Свойство("ДатаНачала") ИЛИ СтруктураПараметров.ДатаНачала = Неопределено, '00010101', НачалоДня(СтруктураПараметров.ДатаНачала)));
	Если ЗначениеЗаполнено(СтруктураПараметров.ДатаОкончания) Тогда
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(СтруктураПараметров.ДатаОкончания));
	КонецЕсли;
	Запрос.УстановитьПараметр("Организация", СтруктураПараметров.Организация);

	ВозвращаемыеПараметры = Новый Структура("ПроведеноДокументов, НеУдалосьПровести, ВывестиИнформациюУведомлений, АдресХранилищаСОшибками, ДополнительныеПараметры, ПроведениеПрервано", 0, 0, Ложь, СтруктураПараметров.АдресХранилищаСОшибками, ?(СтруктураПараметров.Свойство("ДополнительныеПараметры"),СтруктураПараметров.ДополнительныеПараметры,""), Ложь);  

	ПараметрыСообщенийПрогресса 			= НовыеПараметрыСообщенийПрогресса();
	ПараметрыСообщенийПрогресса.ИмяЭтапа 	= "ПерепроведениеДокументов";

#Удаление
	Запрос.Текст = ПолучитьТекстЗапросаПоПервичнымДокументам();
#КонецУдаления
#Вставка

	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураПараметров, "ВыбранныеТипы", "") = "" Тогда
		Запрос.Текст = ПолучитьТекстЗапросаПоПервичнымДокументам();
	Иначе
		Запрос.Текст = ГП_ПолучитьТекстЗапросаПоПервичнымДокументам(СтруктураПараметров.ВыбранныеТипы);
	КонецЕсли;

#КонецВставки

	// Устанавливаем отбор по организации
	ТекстУсловияПоОрганизации = ?(СтруктураПараметров.ТолькоВыбранныеОрганизации, "И Журнал.организация В (&Организация)", "");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеОрганизации", ТекстУсловияПоОрганизации);

	// Устанавливаем отбор по периоду
	Если ЗначениеЗаполнено(СтруктураПараметров.ДатаОкончания) Тогда
		ТекстУсловияПериода = ?(ЗначениеЗаполнено(СтруктураПараметров.ДатаНачала), "И Журнал.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания", " И Журнал.Дата <= &ДатаОкончания");
	ИначеЕсли ЗначениеЗаполнено(СтруктураПараметров.ДатаНачала) Тогда
		ТекстУсловияПериода = " И Журнал.Дата >= &ДатаНачала";
	Иначе
		ТекстУсловияПериода = "";
	КонецЕсли;

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеПериода", ТекстУсловияПериода);
	Запрос.Текст = Запрос.Текст + "
	|УПОРЯДОЧИТЬ ПО
	|	Месяц, Организация, Дата, Ссылка";

	ВсеДокументы = Запрос.Выполнить().Выгрузить();

	ВсегоДокументов = ВсеДокументы.Количество();

	ДатаНачала = '00010101';

	Если ЗначениеЗаполнено(СтруктураПараметров.ДатаНачала) Тогда
		ДатаНачала = НачалоДня(СтруктураПараметров.ДатаНачала);
	КонецЕсли;

	ДатаОкончания = '00010101';
	Если ЗначениеЗаполнено(СтруктураПараметров.ДатаОкончания) Тогда
		ДатаОкончания = КонецДня(СтруктураПараметров.ДатаОкончания);
	КонецЕсли;

	ТаблицаСообщений	= ПроведениеСервер.НовыеСообщенияПользователю();

	ПроведениеПрервано	= Ложь;

	Если НЕ СтруктураПараметров.ДанныеЗаблокированы Тогда
		ПроведениеПрервано = НЕ ЗаблокироватьДанныеПередПроведением(СтруктураПараметров.Организация, ТаблицаСообщений);

		Если ПроведениеПрервано Тогда
			ВозвращаемыеПараметры.ПроведениеПрервано = ПроведениеПрервано;
			ДобавитьСообщенияВРезультатОбработки(ТаблицаСообщений, ВозвращаемыеПараметры, ДатаНачала, ДатаОкончания);

			ОценкаПроизводительности.ЗакончитьЗамерВремени("Обработка ""групповое перепроведение документов""", ВремяНачала);

			ПоместитьВоВременноеХранилище(ВозвращаемыеПараметры, АдресХранилища);

			Возврат;
		КонецЕсли;
	КонецЕсли;

	ДатаПредыдущегоПерепроведения = '00010101';  	
	ТекущаяДатаПроведения  = ?(СтруктураПараметров.ДатаНачала = Неопределено, '00010101', НачалоДня(СтруктураПараметров.ДатаНачала));

	ТекущийМесяц = Неопределено;
	ТекущаяОрганизация = Неопределено;
	ТекущаяДатаПроведения  = Неопределено;

	Для Индекс = 0 По ВсегоДокументов - 1 Цикл

		СтрокаДокумента = ВсеДокументы[Индекс]; 

		Если ТекущийМесяц <> СтрокаДокумента.Месяц ИЛИ ТекущаяОрганизация <> СтрокаДокумента.Организация Тогда

			ТекущаяОрганизация = СтрокаДокумента.Организация;
			ТекущийМесяц = СтрокаДокумента.Месяц;

			ДатаОкончанияМесяца = Мин(ДатаОкончания, КонецМесяца(ТекущийМесяц));

			ТекущаяДатаПроведения  = СтрокаДокумента.Дата;

			// Заполним общие параметры для сообщений прогресса.
			ПараметрыСообщенийПрогресса.Месяц = ТекущийМесяц;
			ПараметрыСообщенийПрогресса.Организация   = ТекущаяОрганизация;
			ПараметрыСообщенийПрогресса.НачальноеЗначение = ТекущийМесяц;
			ПараметрыСообщенийПрогресса.КонечноеЗначение  = ДатаОкончанияМесяца;

			Если СтруктураПараметров.СообщатьПрогрессВыполнения Тогда
				// Сообщим, что начинаем перепроведение за новый месяц и/или по новой организации.
				СообщитьПрогресс(ПараметрыСообщенийПрогресса, НачалоДня(ТекущийМесяц) - 1);
			КонецЕсли;	

		КонецЕсли;	

		Если СтрокаДокумента.РучнаяКорректировка Тогда

			ТекстСообщения = НСтр(
			"ru = 'Не удалось провести документ ""%1"",
			|так как движения данного документа скорректированы вручную.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СтрокаДокумента.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, СтрокаДокумента.Ссылка);
			ВозвращаемыеПараметры.НеУдалосьПровести = ВозвращаемыеПараметры.НеУдалосьПровести + 1;

			ПроведениеСервер.ЗапомнитьСообщенияПользователю(
			ТаблицаСообщений,
			СтрокаДокумента.Организация,
			ТекстСообщения,
			СтрокаДокумента.Ссылка,
			СтрокаДокумента.Дата);

		Иначе

			ДокументОбъект = СтрокаДокумента.Ссылка.ПолучитьОбъект();

			ДокументНеПровелся = Истина;

			Попытка
				Если ДокументОбъект.ПроверитьЗаполнение() Тогда 

					ДокументОбъект.ДополнительныеСвойства.Вставить("ГрупповоеПерепроведение", Истина);

					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);

					ПроведениеСервер.ЗапомнитьСообщенияПользователю(
					ТаблицаСообщений,
					СтрокаДокумента.Организация,
					"",
					СтрокаДокумента.Ссылка,
					СтрокаДокумента.Дата,
					Ложь);

					ДокументНеПровелся = Ложь;
					ВозвращаемыеПараметры.ПроведеноДокументов = ВозвращаемыеПараметры.ПроведеноДокументов + 1;
				КонецЕсли;
			Исключение					
			КонецПопытки;

			Если ДокументНеПровелся Тогда
				ТекстСообщения = НСтр("ru = 'Документ ""%1"" не проведен!'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СтрокаДокумента.Ссылка);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, СтрокаДокумента.Ссылка); 

				ПроведениеСервер.ЗапомнитьСообщенияПользователю(
				ТаблицаСообщений,
				СтрокаДокумента.Организация,
				"",
				СтрокаДокумента.Ссылка,
				СтрокаДокумента.Дата);

				ВозвращаемыеПараметры.НеУдалосьПровести = ВозвращаемыеПараметры.НеУдалосьПровести + 1;
				Если СтруктураПараметров.ОстанавливатьсяПоОшибке Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;

		КонецЕсли;

		// Сообщим, если переходим к следующему дню.
		Если СтруктураПараметров.СообщатьПрогрессВыполнения 
			И ДатаПредыдущегоПерепроведения <> НачалоДня(ТекущаяДатаПроведения) Тогда

			// Сообщим, что начинаем перепроведение за новый месяц и/или по новой организации.
			СообщитьПрогресс(ПараметрыСообщенийПрогресса, ТекущаяДатаПроведения);
			ДатаПредыдущегоПерепроведения = НачалоДня(ТекущаяДатаПроведения);

		КонецЕсли;

	КонецЦикла;

	ДобавитьСообщенияВРезультатОбработки(ТаблицаСообщений, ВозвращаемыеПараметры, ДатаНачала, ДатаОкончания);

	ОценкаПроизводительности.ЗакончитьЗамерВремени("Обработка ""групповое перепроведение документов""", ВремяНачала);

	ПоместитьВоВременноеХранилище(ВозвращаемыеПараметры, АдресХранилища);

КонецПроцедуры

Функция ГП_ПолучитьТекстЗапросаПоПервичнымДокументам(ВыбранныеМетаданные)
	
	// фильтр по метаданным
	ВыбМетаданные = СтрРазделить(ВыбранныеМетаданные, ";");

	ТекстЗапроса = "";
		
	Для Каждого МетаданныеДокумента Из Метаданные.Документы Цикл
		
		// У некоторых ролей нет прав на отдельные документы
		Если НЕ Пользователи.ЭтоПолноправныйПользователь() Тогда
			Если НЕ ПравоДоступа("Чтение", МетаданныеДокумента) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
				
		// Отсечь документы с префиксом Удалить
		Если СтрНайти(МетаданныеДокумента.Имя, "Удалить") = 1 Тогда
			Продолжить;
		КонецЕсли;
		
		Если МетаданныеДокумента = Метаданные.Документы.РегламентированныйОтчет Тогда
			Продолжить;
		КонецЕсли;
				
		Если МетаданныеДокумента.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить 
			И ВыбМетаданные.Найти(МетаданныеДокумента.Имя) <> Неопределено Тогда  	// фильтр по метаданным
			
			ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", "ВЫБРАТЬ РАЗРЕШЕННЫЕ", "
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ") + " 
				|	Дата КАК Дата,
				|	""" + МетаданныеДокумента.Имя + """ КАК ИмяДокумента, 
				|	""" + МетаданныеДокумента.Синоним + """ КАК СинонимДокумента, 
				|	Журнал.Ссылка КАК Ссылка, 
				|	" + ?(МетаданныеДокумента.Реквизиты.Найти("ВидОперации") <> Неопределено, "Журнал.ВидОперации", "Неопределено") + " КАК ВидОперации,
				|	" + ?(МетаданныеДокумента.Реквизиты.Найти("РучнаяКорректировка") <> Неопределено, "РучнаяКорректировка", "ЛОЖЬ") + " КАК РучнаяКорректировка,
				|	ЛОЖЬ КАК РеглДокументНДС,
				|	ЛОЖЬ КАК Выполнена,
				|	Журнал.Представление КАК Представление,
				|	ЛОЖЬ КАК БылаОшибка,
				|	" + ?(МетаданныеДокумента.Реквизиты.Найти("Организация") <> Неопределено, "Журнал.Организация", "Неопределено") + " КАК Организация,
				|	НАЧАЛОПЕРИОДА(Дата, МЕСЯЦ) КАК Месяц
				|ИЗ Документ." + МетаданныеДокумента.Имя + " КАК Журнал
				|ГДЕ Проведен 
				|	И &УсловиеПериода
				|	" + ?(МетаданныеДокумента.Реквизиты.Найти("Организация") <> Неопределено, "И &УсловиеОрганизации", "");
						
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецЕсли
